#+BEGIN_HTML
---
layout: notes
---
#+END_HTML
#+TOC: headlines 4

* Starting Out
  In GHCi to modify the prompt ~:set prompt your_custom_prompt~

  An /infix function/ is a function with parameters on both sides.
  For example ~6 * 3~, ~*~ being the function here. A /prefix
  function/ has all its parameters on the right. For example ~div
  92 10~.

  /Prefix functions/ can become /infix functions/ by adding
  back-ticks ~`~.

#+begin_src haskell :exports both
  let doubleMe x = x + x
  let doubleUs x y = x * 2 + y * 2
  let doubleSmallNumber x = (if x > 100 then x else doubleMe x)

  show (doubleMe 3) ++ " " ++  show (doubleUs 2 5) ++ " " ++ show (doubleSmallNumber 2)
#+end_src

#+RESULTS:
: 6 14 4

  It is important to note that the /else/ part is mandatory in
  /Haskell/. /if/ is a function and it needs to return something.

  We use an apostrophe  to note a strict (as opposed to lazy) or slightly
  modified version of a function.

#+begin_src haskell :exports both
  let doubleSmallNumber' x = (if x > 100 then x else x * 2) + 1
      doubleSmallNumber' 10
#+end_src

#+RESULTS:
: 21

** Lists

   List are homogeneous. They can't contain elements of different
   type.

#+name: lists
#+begin_src haskell
  [1, 2, 3, 4, 5, 6]
  "hello" == ['h', 'e', 'l', 'l', 'o']
#+end_src

#+RESULTS: lists
: True

   We can use ~++~ to concatenate two lists. But be careful it is
   slow on long lists.

#+begin_src haskell
  "A" ++ " small cat"
#+end_src

#+RESULTS:
: A small cat

   It is much better to use ~:~ to add a single character as it is quick

#+begin_src haskell
  'A' : " small cat"
#+end_src

#+RESULTS:
: A small cat

   We can use ~!!~ to retrieve a single element from a list

#+begin_src haskell
 "Aurélien" !! 2
#+end_src

#+RESULTS:
: r

   List anatomy:
   | Head | t | a | i | l |

   | i | n | i | t | last |

** Ranges

   Instead of typing long list we can initialize them quickly with
   /ranges/.

   + ~[1..20]~
   + ~[2,4..20]~
   + ~[12,26..24*13]~

   And since Haskell is lazy (it does not try to evaluate an
   infinite list immediately) it makes cool things possible.

#+begin_src  haskell
   take 3 (repeat 5)
#+end_src

#+RESULTS:
| 5 | 5 | 5 |

** Lists comprehensions

   Lists comprehensions are a way to filter, transform and combine lists

#+begin_src  haskell
   [ x * 2 | x <- [1..10]]
#+end_src

#+RESULTS:
| 2 | 4 | 6 | 8 | 10 | 12 | 14 | 16 | 18 | 20 |

   ~x <- [1..10]~ is called the generator

   ~_~ can be used as a temporary variable when we don't care about that particular value

#+begin_src haskell
   let length' xs = sum [1 | _ <- xs]
   length' [1,2,3]
#+end_src

#+RESULTS:
: 3

** Tuples

   /Tuples/ are used to store several heterogeneous elements as a
   single value. They are useful as a way to enforce homogeneous
   elements you want a list of vector.
   As ~[[1,2],[2,3,4],[4,5]]~ is possible but wrong if you want to
   represent a list of vectors. ~[(1,2),(8,11),(4,5)]~ is much
   better and we can only add to this list tuples composed of two
   integers.

#+begin_src  haskell
   fst (8,11)
#+end_src

#+RESULTS:
: 8

#+begin_src  haskell
   snd (8, 11)
#+end_src

#+RESULTS:
: 11

#+begin_src  haskell
   zip [1,2,3] [4,5,6]
#+end_src

#+RESULTS:
| 1 | 4 |
| 2 | 5 |
| 3 | 6 |


    Here is an example to illustrate everything we learned. How to
    find all right triangle with side lengths all integers, all
    side lengths less or equal to ten and a perimeter equal to 24?

#+begin_src  haskell
[(a,b,c) | c <- [1..10], a <- [1..c], b <- [1..a], a^2 + b^2 == c^2, a+b+c == 24]
#+end_src

#+RESULTS:
| 8 | 6 | 10 |

* Believe the type

  Inside GHCi we can use ~:t~ to find the type. It gives us result
  of the form ~expression::type~. ~::~ can be read as ‘type of’.

  We can use type declarations with our functions. And we are
  unsure of the type declaration we can use ~:t~ as a way to find
  or verify the type declaration

#+begin_src haskell
  let addThree::Int -> Int -> Int -> Int
  let addThree x y z = x + y + z

  addThree 1 2 3
#+end_src

#+RESULTS:
: 6

  Main types in Haskell are
  + Int
  + Float
  + Double
  + Bool
  + Char
  + Tuples


  A type variable are used in functions which can take different
  types. For example /head/ type definition is ~head::[a] -> a~.
  Functions that use type variables are called polymorphic
  functions.

** Type Class

  A type class is an interface that defines a behavior.

  Some type class are
  + Eq
  + Ord
  + Ordering
  + Show
  + Read
  + Num
  + Floating
  + Integral
  + Enum
  + Bounded

    ~==~ as a type definition of ~(==)::(Eq a) => a -> a -> bool~.
    Everything before ~=>~ are called class constraints. ~==~ type
    definition means it takes two argument of the same type. Those
    two elements must be member of the equality class.

    Sometimes we need to specify type annotations to tell Haskell
    which type an expression should be.

#+begin_src  haskell
  read "5" :: Int
#+end_src

#+RESULTS:
: 5
  A type can be part of many type classes.

** As pattern

   An /as pattern/ is used to keep reference to an original item.
   An /as pattern/ is defined with an ~@~.

#+begin_src haskell
  firstLetter::String -> String
  firstLetter all@(x:xs) = "First letter of " ++ all ++ " is " ++ [x]

  firstLetter "Amour"
#+end_src

#+RESULTS:
: Prelude>
: <interactive>:29:1: Not in scope: `firstLetter'

** Let expressions

   /Let expressions/ allows us to bind variables at the end of a function

   The syntax is ~let <bindings> in <expression>~. We can omit the
   in part in GHCi and names will be visible during the while GHCi
   session.

#+begin_src haskell
(let (a,b,c) = (1,2,3) in a+b+c) * 100
#+end_src

#+RESULTS:
: 600

   We can also use /let expressions/ in list comprehensions.

#+begin_src haskell
  calcBmis::[(Double, Double)] -> [Double]
  calcBmis xs = [bmi | (w, h) <- xs, let bmi = w / h^2]
#+end_src

** Curried functions

   In Haskell when a function takes one that more parameter it is
   a /curried function/. In reality it takes only one parameter
   then return a function that takes the next parameter etc.

#+BEGIN_SRC haskell
  let multThree x y z = x * y * z
  let mulTwoWithNine = multThree 9
  mulTwoWithNine 2 3
#+END_SRC

#+RESULTS:
: 54

** Sections

   Infix functions can be partially applied by using /sections/.
   We use a section by surrounding the function with parenthesis.

#+BEGIN_SRC haskell
  let divideByTen = (/10)
      divideByTen 20
#+END_SRC

#+RESULTS:
: 2.0

** ~$~ the /function application operator

   It allows use to use less parenthesis.
   ~$~ is right associative and has the lowest precedence

   so

#+BEGIN_SRC haskell
  sum (filter ( > 10) (map (*2) [2..10]))
#+END_SRC

#+RESULTS:
: 80

   is the same as

#+BEGIN_SRC haskell
  sum $ filter ( > 10) $ map (*2) [2..10]
#+END_SRC

#+RESULTS:
: 80

** Function composition with ~.~

   /(f o g) (x) = f(g(x))/

   it means composing two functions is the equivalent of calling
   one function with the same value and then calling another one
   with the result of the first function.

   /function composition/ is right-associative so we can compose
   many functions at a time.

#+BEGIN_SRC haskell
  map (\xs -> negate (sum (tail xs))) [[1..5], [3..6], [1..7]]
#+END_SRC

#+RESULTS:
| -14 | -15 | -27 |

  is the same as

#+BEGIN_SRC haskell
  map (negate . sum . tail) [[1..5], [3..6], [1..7]]
#+END_SRC

#+RESULTS:
| -14 | -15 | -27 |

  We can use function composition with multiple parameters thanks
  to ~$~

#+BEGIN_SRC haskell
  sum . replicate 5 $ max 6.7 8.9
#+END_SRC

#+RESULTS:
: 44.5

** Strict folds

   In case of stack overflow don't forget to try strict versions
   of folds.

   Following is slow because of deferred computations
#+BEGIN_SRC haskell
  foldl (+) 0 (replicate 100000000 1)
#+END_SRC

   Much faster and without stack overflow
#+BEGIN_SRC haskell
  :m + Data.list
  foldl' (+) 0 (replicate 100000 1)
#+END_SRC

#+RESULTS:
: <interactive>:156:1:
:     Not in scope: foldl'
:     Perhaps you meant one of these:
:       `foldl1' (imported from Prelude), `foldl' (imported from Prelude),
:       `foldr' (imported from Prelude)

* Applicative Functors

  fmap over functions is just function compositions

#+BEGIN_SRC haskell
  fmap :: (a -> b) -> (r -> a) -> (r -> b)
#+END_SRC

  ~r ->~ can be viewed as ~(->) r~

  Here we piped the output of ~r->a~ into  the input of ~a->b~ to
  get a function ~r->b~

#+BEGIN_SRC haskell :exports both
  fmap (*3) (+100) 1
#+END_SRC

#+RESULTS:
: 303

  We can see fmap as a function that takes a function and returns
  a functions that takes a functor value as parameter and returns
  a functor value as the result. It takes an ~a->b~ function and
  returns a function ~f a -> f b~. This is called *lifting* a
  function.

  #+BEGIN_SRC haskell :exports both
    fmap (replicate 3) [1,2,3,4]
  #+END_SRC

  #+RESULTS:
  | 1 | 1 | 1 |
  | 2 | 2 | 2 |
  | 3 | 3 | 3 |
  | 4 | 4 | 4 |


  So we can think of fmap in two ways:

  - As a function that takes a function and a functor value and
    then maps that function over the functor value.
  - As a function that takes a function and lifts that function so
    it operates on functor values.

*** ~fmap id = id~
    id is the identity function which just returns its parameter
    unmodified

    #+BEGIN_SRC haskell
      fmap id (Just 3)
    #+END_SRC

    #+RESULTS:
    : Just 3

** Applicative type class

   With two functions, ~pure~ and ~<*>~.

   ~pure~ only act as a box.
   ~<*>~ extracts a function from a functor and map it over a
   second one

   #+BEGIN_SRC haskell
     :m + Control.Applicative
     pure (+3) <*> Just 10
   #+END_SRC

   #+RESULTS:
   : Just 13

   ~Control.Applicative~ exports another function ~<$>~. It is an fmap as an infix
   operator.

   So
   #+BEGIN_SRC haskell
     :m + Control.Applicative
     pure (++) <*> Just "John Tra" <*> Just "volta"
   #+END_SRC

   #+RESULTS:
   : Just "John TraVolta"

   is the same as

   #+BEGIN_SRC haskell
     :m + Control.Applicative
     (++) <$> Just "John Tra" <*> Just "volta"
   #+END_SRC

   #+RESULTS:
   : Just "John TraVolta"

** Lists are applicative functors too

   #+BEGIN_SRC haskell
     :m + Control.Applicative
     pure "Hey" :: Maybe String
   #+END_SRC

   #+RESULTS:
   : Just "Hey"

   #+BEGIN_SRC haskell
     :m + Control.Applicative
     [(*0),(+100),(^2)] <*> [1,2,3]
   #+END_SRC

   #+RESULTS:
   | 0 | 0 | 0 | 101 | 102 | 103 | 1 | 4 | 9 |

   Applicative style on lists can be a good replacement for list comprehensions.

   #+BEGIN_SRC haskell
     [ x*y | x <- [2,5,10], y <- [8,10,11]]
   #+END_SRC

   #+RESULTS:
   | 16 | 20 | 22 | 40 | 50 | 55 | 80 | 100 | 110 |

   is equivalent to

   #+BEGIN_SRC haskell
     :m + Control.Applicative
     (*) <$> [2,5,10] <*> [8,10,11]
   #+END_SRC

   #+RESULTS:
   | 16 | 20 | 22 | 40 | 50 | 55 | 80 | 100 | 110 |

** Functions as applicative ~-> r~


   #+BEGIN_SRC haskell
     (+) <$> (+3) <*> (*100) $ 5
   #+END_SRC

   #+RESULTS:
   : 508

** ZipLists

   It is another way for lists to be applicative

   #+BEGIN_SRC haskell
     getZipList $ (+) <$> ZipList[1,2,3] <*> ZipList[100,100,100]
   #+END_SRC

   #+RESULTS:
   | 101 | 102 | 103 |

   Final list lenght is the length of the smallest list

   #+BEGIN_SRC haskell
     getZipList $ (+) <$> ZipList[1,2,3] <*> ZipList[100,100..]
   #+END_SRC

   #+RESULTS:
   | 101 | 102 | 103 |


   #+BEGIN_SRC haskell
     getZipList $ (,,) <$> ZipList "dog" <*> ZipList "cat" <*> ZipList "rat"
   #+END_SRC

   #+RESULTS:
   | d | c | r |
   | o | a | a |
   | g | t | t |
